УчетВУправляющихДляГит1/src/InformationRegisters/СтатусОбменовСЯндексКассой/СтатусОбменовСЯндексКассой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусОбменовСЯндексКассой</name>
  <resources>
    <name>ДатаПоследнегоУспешногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <comment>Реквизит необходим для обеспечения ограничения доступа</comment>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаЯндексКассы</name>
    <type>
      <types>CatalogRef.НастройкиЯндексКассы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/СтатусОбменовСЯндексКассой/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.НастройкаЯндексКассы) Тогда
		ТекущаяЗапись = РегистрыСведений.СтатусОбменовСЯндексКассой.СоздатьМенеджерЗаписи();
		ТекущаяЗапись.НастройкаЯндексКассы = Параметры.НастройкаЯндексКассы;
		ТекущаяЗапись.Прочитать();
		
		// Для новой настройки записей в регистре еще нет
		Если Не ТекущаяЗапись.Выбран() Тогда
			ТекущаяЗапись.НастройкаЯндексКассы = Параметры.НастройкаЯндексКассы;
			ТекущаяЗапись.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.НастройкаЯндексКассы, "Организация");
		КонецЕсли;
	
		ЗначениеВРеквизитФормы(ТекущаяЗапись, "Запись");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
